Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-GP_DFP/1.6.144/edc/PIC32MK0512GPE100.PIC
      <edc:SFRDef edc:_addr="0x1F860640" edc:_begin="0x0" edc:_end="0xe0" edc:_modsrc="DOS-02467_gpio_ports_upb_v1.Module" edc:_refcount="7" edc:access="----------------nnnnnnnnnn----nn" edc:cname="ODCG" edc:desc="" edc:grp="PORTG" edc:impl="0xffffffc3" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------0000000000----00" edc:name="ODCG" edc:nzwidth="0x20" edc:por="----------------0000000000----00" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTG">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="ODCG0" edc:desc="" edc:mask="0x1" edc:name="ODCG0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ODCG1" edc:desc="" edc:mask="0x1" edc:name="ODCG1" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="ODCG6" edc:desc="" edc:mask="0x1" edc:name="ODCG6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ODCG7" edc:desc="" edc:mask="0x1" edc:name="ODCG7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ODCG8" edc:desc="" edc:mask="0x1" edc:name="ODCG8" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ODCG9" edc:desc="" edc:mask="0x1" edc:name="ODCG9" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ODCG10" edc:desc="" edc:mask="0x1" edc:name="ODCG10" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ODCG11" edc:desc="" edc:mask="0x1" edc:name="ODCG11" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ODCG12" edc:desc="" edc:mask="0x1" edc:name="ODCG12" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ODCG13" edc:desc="" edc:mask="0x1" edc:name="ODCG13" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ODCG14" edc:desc="" edc:mask="0x1" edc:name="ODCG14" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ODCG15" edc:desc="" edc:mask="0x1" edc:name="ODCG15" edc:nzwidth="0x1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F860650" edc:_begin="0x0" edc:_end="0xe0" edc:_modsrc="DOS-02467_gpio_ports_upb_v1.Module" edc:_refcount="7" edc:access="----------------nnnnnnnnnn----nn" edc:cname="CNPUG" edc:desc="" edc:grp="PORTG" edc:impl="0xffffffc3" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------0000000000----00" edc:name="CNPUG" edc:nzwidth="0x20" edc:por="----------------0000000000----00" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTG">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CNPUG0" edc:desc="" edc:mask="0x1" edc:name="CNPUG0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUG1" edc:desc="" edc:mask="0x1" edc:name="CNPUG1" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="CNPUG6" edc:desc="" edc:mask="0x1" edc:name="CNPUG6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUG7" edc:desc="" edc:mask="0x1" edc:name="CNPUG7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUG8" edc:desc="" edc:mask="0x1" edc:name="CNPUG8" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUG9" edc:desc="" edc:mask="0x1" edc:name="CNPUG9" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUG10" edc:desc="" edc:mask="0x1" edc:name="CNPUG10" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUG11" edc:desc="" edc:mask="0x1" edc:name="CNPUG11" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUG12" edc:desc="" edc:mask="0x1" edc:name="CNPUG12" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUG13" edc:desc="" edc:mask="0x1" edc:name="CNPUG13" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUG14" edc:desc="" edc:mask="0x1" edc:name="CNPUG14" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUG15" edc:desc="" edc:mask="0x1" edc:name="CNPUG15" edc:nzwidth="0x1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F860660" edc:_begin="0x0" edc:_end="0xe0" edc:_modsrc="DOS-02467_gpio_ports_upb_v1.Module" edc:_refcount="7" edc:access="----------------nnnnnnnnnn----nn" edc:cname="CNPDG" edc:desc="" edc:grp="PORTG" edc:impl="0xffffffc3" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------0000000000----00" edc:name="CNPDG" edc:nzwidth="0x20" edc:por="----------------0000000000----00" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTG">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CNPDG0" edc:desc="" edc:mask="0x1" edc:name="CNPDG0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPDG1" edc:desc="" edc:mask="0x1" edc:name="CNPDG1" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="CNPDG6" edc:desc="" edc:mask="0x1" edc:name="CNPDG6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPDG7" edc:desc="" edc:mask="0x1" edc:name="CNPDG7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPDG8" edc:desc="" edc:mask="0x1" edc:name="CNPDG8" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPDG9" edc:desc="" edc:mask="0x1" edc:name="CNPDG9" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPDG10" edc:desc="" edc:mask="0x1" edc:name="CNPDG10" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPDG11" edc:desc="" edc:mask="0x1" edc:name="CNPDG11" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPDG12" edc:desc="" edc:mask="0x1" edc:name="CNPDG12" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPDG13" edc:desc="" edc:mask="0x1" edc:name="CNPDG13" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPDG14" edc:desc="" edc:mask="0x1" edc:name="CNPDG14" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPDG15" edc:desc="" edc:mask="0x1" edc:name="CNPDG15" edc:nzwidth="0x1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F860670" edc:_begin="0x0" edc:_end="0xe0" edc:_modsrc="DOS-02467_gpio_ports_upb_v1.Module" edc:_refcount="7" edc:access="----------------n---n-----------" edc:cname="CNCONG" edc:desc="" edc:grp="PORTG" edc:impl="0xffff9fff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------0---0-----------" edc:name="CNCONG" edc:nzwidth="0x20" edc:por="----------------0---0-----------" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTG">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="0xb"/>
            <edc:SFRFieldDef edc:cname="EDGEDETECT" edc:mask="0x1" edc:name="EDGEDETECT" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="ON" edc:desc="" edc:mask="0x1" edc:name="ON" edc:nzwidth="0x1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
        <edc:FreezeBit edc:freezeval="1" edc:name="CHANGE NOTICE G" edc:pos="14"/>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F860680" edc:_begin="0x0" edc:_end="0xe0" edc:_modsrc="DOS-02467_gpio_ports_upb_v1.Module" edc:_refcount="7" edc:access="----------------nnnnnnnnnn----nn" edc:cname="CNENG" edc:desc="" edc:grp="PORTG" edc:impl="0xffc0ffc3" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------0000000000----00" edc:name="CNENG" edc:nzwidth="0x20" edc:por="----------------0000000000----00" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTG">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CNIEG0" edc:desc="" edc:mask="0x1" edc:name="CNIEG0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIEG1" edc:desc="" edc:mask="0x1" edc:name="CNIEG1" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="CNIEG6" edc:desc="" edc:mask="0x1" edc:name="CNIEG6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIEG7" edc:desc="" edc:mask="0x1" edc:name="CNIEG7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIEG8" edc:desc="" edc:mask="0x1" edc:name="CNIEG8" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIEG9" edc:desc="" edc:mask="0x1" edc:name="CNIEG9" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIEG10" edc:desc="" edc:mask="0x1" edc:name="CNIEG10" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIEG11" edc:desc="" edc:mask="0x1" edc:name="CNIEG11" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIEG12" edc:desc="" edc:mask="0x1" edc:name="CNIEG12" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIEG13" edc:desc="" edc:mask="0x1" edc:name="CNIEG13" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIEG14" edc:desc="" edc:mask="0x1" edc:name="CNIEG14" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIEG15" edc:desc="" edc:mask="0x1" edc:name="CNIEG15" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F860690" edc:_begin="0x0" edc:_end="0xe0" edc:_modsrc="DOS-02467_gpio_ports_upb_v1.Module" edc:_refcount="7" edc:access="----------------nnnnnnnnnn----nn" edc:cname="CNSTATG" edc:desc="" edc:grp="PORTG" edc:impl="0xffffffc3" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------0000000000----00" edc:name="CNSTATG" edc:nzwidth="0x20" edc:por="----------------0000000000----00" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTG">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CNSTATG0" edc:desc="" edc:mask="0x1" edc:name="CNSTATG0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATG1" edc:desc="" edc:mask="0x1" edc:name="CNSTATG1" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="CNSTATG6" edc:desc="" edc:mask="0x1" edc:name="CNSTATG6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATG7" edc:desc="" edc:mask="0x1" edc:name="CNSTATG7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATG8" edc:desc="" edc:mask="0x1" edc:name="CNSTATG8" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATG9" edc:desc="" edc:mask="0x1" edc:name="CNSTATG9" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATG10" edc:desc="" edc:mask="0x1" edc:name="CNSTATG10" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATG11" edc:desc="" edc:mask="0x1" edc:name="CNSTATG11" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATG12" edc:desc="" edc:mask="0x1" edc:name="CNSTATG12" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATG13" edc:desc="" edc:mask="0x1" edc:name="CNSTATG13" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATG14" edc:desc="" edc:mask="0x1" edc:name="CNSTATG14" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATG15" edc:desc="" edc:mask="0x1" edc:name="CNSTATG15" edc:nzwidth="0x1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8606A0" edc:_begin="0x0" edc:_end="0xe0" edc:_modsrc="DOS-02467_gpio_ports_upb_v1.Module" edc:_refcount="7" edc:access="----------------nnnnnnnnnn----nn" edc:cname="CNNEG" edc:desc="" edc:impl="0xffc3" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------0000000000----00" edc:name="CNNEG" edc:nzwidth="32" edc:por="----------------0000000000----00" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTG">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CNNEG0" edc:mask="0x1" edc:name="CNNEG0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNNEG1" edc:mask="0x1" edc:name="CNNEG1" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="CNNEG6" edc:mask="0x1" edc:name="CNNEG6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNNEG7" edc:mask="0x1" edc:name="CNNEG7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNNEG8" edc:mask="0x1" edc:name="CNNEG8" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNNEG9" edc:mask="0x1" edc:name="CNNEG9" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNNEG10" edc:mask="0x1" edc:name="CNNEG10" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNNEG11" edc:mask="0x1" edc:name="CNNEG11" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNNEG12" edc:mask="0x1" edc:name="CNNEG12" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNNEG13" edc:mask="0x1" edc:name="CNNEG13" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNNEG14" edc:mask="0x1" edc:name="CNNEG14" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNNEG15" edc:mask="0x1" edc:name="CNNEG15" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
