Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-GP_DFP/1.6.144/edc/PIC32MK0512GPE100.PIC
      <edc:AdjustPoint edc:_addr="0x1F881240" edc:offset="16"/>
      <edc:AdjustPoint edc:_addr="0x1F881250" edc:offset="16"/>
      <edc:AdjustPoint edc:_addr="0x1F881260" edc:offset="16"/>
      <edc:AdjustPoint edc:_addr="0x1F881270" edc:offset="16"/>
      <edc:AdjustPoint edc:_addr="0x1F881280" edc:offset="16"/>
      <edc:AdjustPoint edc:_addr="0x1F881290" edc:offset="16"/>
      <edc:AdjustPoint edc:_addr="0x1F8812A0" edc:offset="16"/>
      <edc:AdjustPoint edc:_addr="0x1F8812B0" edc:offset="16"/>
      <edc:AdjustPoint edc:_addr="0x1F8812C0" edc:offset="16"/>
      <edc:AdjustPoint edc:_addr="0x1F8812D0" edc:offset="16"/>
      <edc:AdjustPoint edc:_addr="0x1F8812E0" edc:offset="16"/>
      <edc:AdjustPoint edc:_addr="0x1F8812F0" edc:offset="16"/>
      <edc:AdjustPoint edc:_addr="0x1F881300" edc:offset="16"/>
      <edc:AdjustPoint edc:_addr="0x1F881310" edc:offset="16"/>
      <edc:AdjustPoint edc:_addr="0x1F881320" edc:offset="16"/>
      <edc:AdjustPoint edc:_addr="0x1F881330" edc:offset="16"/>
      <edc:SFRDef edc:_addr="0x1F881340" edc:_begin="0x0" edc:_end="0xb50" edc:_modsrc="DOS-01152_can_bvci_v1.Module" edc:_refcount="2" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnrr" edc:cname="C2FIFOBA" edc:desc="" edc:grp="CAN1" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="C2FIFOBA" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="CAN2">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="2"/>
            <edc:SFRFieldDef edc:cname="FIFOBA" edc:desc="" edc:islanghidden="true" edc:mask="0x3fffffff" edc:name="FIFOBA" edc:nzwidth="0x1e"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F881350" edc:_begin="0x0" edc:_end="0xb50" edc:_modsrc="DOS-01152_can_bvci_v1.Module" edc:_refcount="2" edc:access="-----------nnnnn-nnn----nnnnnnnn" edc:cname="C2FIFOCON0" edc:desc="" edc:grp="CAN1" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="C2FIFOCON0" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="CAN2">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="TXPRI" edc:desc="" edc:mask="0x3" edc:name="TXPRI" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="RTREN" edc:desc="" edc:mask="0x1" edc:name="RTREN" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TXREQ" edc:desc="" edc:mask="0x1" edc:name="TXREQ" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TXERR" edc:desc="" edc:mask="0x1" edc:name="TXERR" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TXLARB" edc:desc="" edc:mask="0x1" edc:name="TXLARB" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TXABAT" edc:desc="" edc:mask="0x1" edc:name="TXABAT" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TXEN" edc:desc="" edc:mask="0x1" edc:name="TXEN" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="4"/>
            <edc:SFRFieldDef edc:cname="DONLY" edc:desc="" edc:mask="0x1" edc:name="DONLY" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="UINC" edc:desc="" edc:mask="0x1" edc:name="UINC" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FRESET" edc:desc="" edc:mask="0x1" edc:name="FRESET" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="FSIZE" edc:desc="" edc:mask="0x1f" edc:name="FSIZE" edc:nzwidth="0x5"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F881360" edc:_begin="0x0" edc:_end="0xb50" edc:_modsrc="DOS-01152_can_bvci_v1.Module" edc:_refcount="2" edc:access="-----nnn----nnnn-----rrr----nrrr" edc:cname="C2FIFOINT0" edc:desc="" edc:grp="CAN1" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="C2FIFOINT0" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="CAN2">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="RXNEMPTYIF" edc:desc="" edc:mask="0x1" edc:name="RXNEMPTYIF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXHALFIF" edc:desc="" edc:mask="0x1" edc:name="RXHALFIF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXFULLIF" edc:desc="" edc:mask="0x1" edc:name="RXFULLIF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXOVFLIF" edc:desc="" edc:mask="0x1" edc:name="RXOVFLIF" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="4"/>
            <edc:SFRFieldDef edc:cname="TXEMPTYIF" edc:desc="" edc:mask="0x1" edc:name="TXEMPTYIF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TXHALFIF" edc:desc="" edc:mask="0x1" edc:name="TXHALFIF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TXNFULLIF" edc:desc="" edc:mask="0x1" edc:name="TXNFULLIF" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="5"/>
            <edc:SFRFieldDef edc:cname="RXNEMPTYIE" edc:desc="" edc:mask="0x1" edc:name="RXNEMPTYIE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXHALFIE" edc:desc="" edc:mask="0x1" edc:name="RXHALFIE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXFULLIE" edc:desc="" edc:mask="0x1" edc:name="RXFULLIE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXOVFLIE" edc:desc="" edc:mask="0x1" edc:name="RXOVFLIE" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="4"/>
            <edc:SFRFieldDef edc:cname="TXEMPTYIE" edc:desc="" edc:mask="0x1" edc:name="TXEMPTYIE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TXHALFIE" edc:desc="" edc:mask="0x1" edc:name="TXHALFIE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TXNFULLIE" edc:desc="" edc:mask="0x1" edc:name="TXNFULLIE" edc:nzwidth="0x1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
